class SelfEstreem {
  static init() {
    console.log(`
    Спасибо, что дали время доделать!
    Не выполнено:
    1. Дополнительный функционал на выбор +20
      в процессе сортировки, фильтрации, поиска карточки с изображениями игрушек плавно меняют своё положение +10
      Код для плавного перемещения карточек можно написать самостоятельно - пример, или использовать для этой цели библиотеку, Демо 1, Демо 2. Библиотека может использоваться только для перемещения карточек, фильтрацию, сортировку и поиск вам необходимо написать полностью самостоятельно
      очень высокое качество оформления приложения + дополнительный, не указанный в задании, сложный в реализации функционал, улучшающий качество приложения, удобство пользования им +10

    Выполнено
    1. Страница с игрушками содержит карточки всех игрушек а также фильтры, строку поиска, поле для сортировки. Выполняются требования к вёрстке +10
    2. Добавление игрушек в избранное +20
    3. Сортировка +20
    4. Фильтры в указанном диапазоне от и до +30
    5. Фильтры по значению +30
    6. Можно отфильтровать игрушки по нескольким фильтрам разного типа +20
    7. Сброс фильтров +20
    8. Сохранение настроек в local storage +10
    9. Поиск +30
  `);
  }
}

export default SelfEstreem;
